RIET/src/InformationRegisters/РасчетСебестоимости/РасчетСебестоимости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РасчетСебестоимости</name>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>DescriptionSO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоSO</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмеренияSO</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </resources>
  <resources>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаSO</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Account</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>8</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ParentLineID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РучнаяКорректировка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>SiebelOrder</name>
    <type>
      <types>DocumentRef.SiebelOrders</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Good</name>
    <type>
      <types>CatalogRef.InventoryGoods</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AU</name>
    <type>
      <types>CatalogRef.КостЦентры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>PartNumberSO</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Реализация</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Списание</name>
    <type>
      <types>DocumentRef.InventoryСписание</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

RIET/src/Catalogs/UOMs/UOMs.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>UOMs</name>
  <predefined>
    <items>
      <name>CM</name>
      <description>centimeter</description>
    </items>
    <items>
      <name>KG</name>
      <description>kilogram</description>
    </items>
    <items>
      <name>LT</name>
      <description>liter</description>
    </items>
    <items>
      <name>N_A</name>
      <description>non applicable</description>
    </items>
    <items>
      <name>SCM</name>
      <description>standard cubic meter</description>
    </items>
    <items>
      <name>SM</name>
      <description>square metre</description>
    </items>
  </predefined>
  <attributes>
    <name>Standard</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>StandardUOM</name>
    <type>
      <types>CatalogRef.UOMs</types>
    </type>
  </attributes>
  <attributes>
    <name>ConversionFactor</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BasicUOM</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>TMSId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TMSIdForItemUOM</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>InTMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>CreatedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>CreationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ModifiedBy</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ModificationDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>NameRus</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>NameRusFilled</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

RIET/src/InformationRegisters/РасчетСебестоимости/Forms/ФормаНабораЗаписей/Module.bsl
&НаКлиенте
Процедура SiebelOrderПриИзменении(Элемент)
	УстановитьРучнуюКорректировку();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьРучнуюКорректировку()
	Элементы.НаборЗаписей.ТекущиеДанные.РучнаяКорректировка = Истина;
КонецПроцедуры	

&НаКлиенте
Процедура РеализацияПриИзменении(Элемент)
	УстановитьРучнуюКорректировку();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоSOПриИзменении(Элемент)
	УстановитьРучнуюКорректировку();
КонецПроцедуры

&НаКлиенте
Процедура КоличествоПриИзменении(Элемент)
	УстановитьРучнуюКорректировку();
КонецПроцедуры

&НаКлиенте
Процедура СебестоимостьПриИзменении(Элемент)
	УстановитьРучнуюКорректировку();
КонецПроцедуры

&НаКлиенте
Процедура НаборЗаписейПриАктивизацииСтроки(Элемент)
	ТД = Элементы.НаборЗаписей.ТекущиеДанные;
	Если ТД <> Неопределено Тогда
		ТЧСписания.Параметры.УстановитьЗначениеПараметра("Списание",ТД.Регистратор);
		ТЧСиблОрдера.Параметры.УстановитьЗначениеПараметра("Ссылка", ТД.SiebelOrder);
		Элементы.ТЧСиблОрдера.Обновить();
		Элементы.ТЧСписания.Обновить();
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Сопоставить(Команда)
	Если Элементы.ТЧСиблОрдера.ТекущиеДанные = Неопределено ИЛИ Элементы.ТЧСписания.ТекущиеДанные = Неопределено Тогда
		Сообщить("Выберите строки");
		Возврат;
	КонецЕсли;
	СиблОрдер = Элементы.ТЧСиблОрдера.ТекущиеДанные;
	Товар = Элементы.ТЧСписания.ТекущиеДанные.Good;
	Отбор = Новый Структура("Good", Товар);
	СтрокиПоТовару = НаборЗаписей.НайтиСтроки(Отбор);
	CF = Справочники.UOMs.НайтиПоКоду("CF ");
	LB = Справочники.UOMs.НайтиПоКоду("LB ");
	GA = Справочники.UOMs.НайтиПоКоду("GA ");
	Для Каждого Стр Из СтрокиПоТовару Цикл
		Стр.DescriptionSO = СиблОрдер.Description;
		Стр.PartNumberSO = СиблОрдер.PartNumber;
		Стр.КоличествоSO = СиблОрдер.Количество;
		Стр.ЕдиницаИзмеренияSO = Справочники.UOMs.НайтиПоКоду(СиблОрдер.ЕдиницаИзмерения);
		СТр.СуммаSO = СиблОрдер.Сумма;
		Стр.Account = СиблОрдер.Account;
		Стр.ParentLineID = СиблОрдер.ParentLineID;	
		Количество = Стр.Количество;	
		КоличествоSO = Стр.КоличествоSO;
		Если ЗначениеЗаполнено(Стр.ЕдиницаИзмеренияSO) И Стр.ЕдиницаИзмеренияSO <> Стр.ЕдиницаИзмерения Тогда
			Если Стр.ЕдиницаИзмерения.StandardUOM = Стр.ЕдиницаИзмеренияSO Тогда
				Количество = Стр.Количество * Стр.ЕдиницаИзмерения.ConversionFactor;
			ИначеЕсли Стр.ЕдиницаИзмерения.StandardUOM = Стр.ЕдиницаИзмеренияSO.StandardUOM Тогда
				Количество = Стр.Количество * Стр.ЕдиницаИзмерения.ConversionFactor;	
				КоличествоSO = Стр.КоличествоSO * Стр.ЕдиницаИзмеренияSO.ConversionFactor;
			КонецЕсли;
			
			
		ИначеЕсли Стр.ЕдиницаИзмеренияSO = "T" Тогда
			
			Если Стр.ЕдиницаИзмерения = CF ИЛИ Стр.ЕдиницаИзмерения = LB Тогда
				Количество = Стр.Количество * Стр.ЕдиницаИзмерения.ConversionFactor;
				КоличествоSO = Стр.КоличествоSO * 1000;
			ИначеЕсли Стр.ЕдиницаИзмерения = GA Тогда
				Количество = Стр.Количество;
				КоличествоSO = Стр.КоличествоSO * 326.9494;
				
			КонецЕсли;	
			
		КонецЕсли;
		КоличествоSO = ?(КоличествоSO = Неопределено, Стр.КоличествоSO, КоличествоSO);
		Разница = Количество - КоличествоSO;
		ПроцентРасхождения = КоличествоSO / 100 * 1.5;
		Если  Разница>-ПроцентРасхождения И Разница<ПроцентРасхождения Тогда
			Количество = КоличествоSO;
		КонецЕсли;
		Стр.Себестоимость = ?(КоличествоSO = 0, 0, Стр.СуммаСписания  / Количество * КоличествоSO);
		Стр.РучнаяКорректировка = Истина;
	КонецЦикла;	
	
	
КонецПроцедуры
